app/Models/Emp_model.php

    public function getEmpById($id = false)
    {
        if ($id == false) {
			$sql1="select * from ( ".$this->SQL." ) as xxx";
			return $this->db->query($sql1)->getResultArray();
        }
        return $this->table('emp')
        	->where('emp_id', $id)
        	->get()
        	->getRowArray();
---
SELECT *
FROM `emp`
WHERE `emp_id` = '1'